---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCHybridImport.#ctor
source: html/c2391e7e-063b-6739-c090-60994fc64a01.htm
---
# Autodesk.Revit.DB.IFC.IFCHybridImport.#ctor Method

Constructs a new IFCHybridImport instance for importing IFC via Hybrid method.

## Syntax (C#)
```csharp
public IFCHybridImport()
```